app/controllers/pictures_controller.rb

  def index
    month = 1.month.ago
    year = 1.year.ago
    @most_recent_pictures = Picture.most_recent_five
    @created_before = Picture.created_before(month)
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures" WHERE (created_at LIKE '2017-08-13 19:28:21 UTC%')

  def show
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create

    @picture = Picture.new

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save
---
INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "test"], ["title", "test"], ["url", "test"], ["created_at", 2018-08-07 19:40:36 UTC], ["updated_at", 2018-08-07 19:40:36 UTC]]

  def edit
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update

    @picture = Picture.find(params[:id])

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "pictures" SET "url" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["url", "https://www.pablopicasso.org/images/paintings/girl-before-a-mirror.jpg"], ["updated_at", 2018-08-07 20:06:30 UTC], ["id", 4]]

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 6]]