app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "test@gmail.com"], ["password_digest", "$2a$10$EHC/BfrHVYl5Xwt6QHnVW.7b/0fA..SnG7/bUvG1pJEXgbd26UJ/e"], ["created_at", 2018-08-17 17:56:56 UTC], ["updated_at", 2018-08-17 17:56:56 UTC]]
---
  def create
    @user = User.new
    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save